CheatSheet.org
#+TITLE: OCaml Cheat Sheet
# SUBTITLE: Getting Started Reference Sheet
#+MACRO: URL https://github.com/alhassy/OCamlCheatSheet
#+MACRO: ShowURL @@latex:{\tiny\hspace{6em}\url{ {{{URL}}} } }@@
#+AUTHOR: [[http://www.cas.mcmaster.ca/~alhassm/][Musa Al-hassy]] {{{ShowURL}}}
#+EMAIL: alhassy@gmail.com
#+TODO: TODO | spacing
#+OPTIONS: d:nil

# The OCaml toplevel, version 4.07.1

* LaTeX Setup                                                :ignore:
# Can be obtained from: https://github.com/alhassy/MyUnicodeSymbols
#
#+LATEX_HEADER: \usepackage{/Users/musa/MyUnicodeSymbols/MyUnicodeSymbols}

# Removing the red box that appears in "minted" when using unicode.
# Src: https://tex.stackexchange.com/questions/343494/minted-red-box-around-greek-characters
#
#+LATEX_HEADER: \makeatletter
#+LATEX_HEADER: \AtBeginEnvironment{minted}{\dontdofcolorbox}
#+LATEX_HEADER: \def\dontdofcolorbox{\renewcommand\fcolorbox[4][]{##4}}
#+LATEX_HEADER: \makeatother


#+LATEX_HEADER: \usepackage{newunicodechar}
#+LATEX_HEADER: \newunicodechar{⟪}{\ensuremath{\llangle}}
#+LATEX_HEADER: \newunicodechar{⟫}{\ensuremath{\rrangle}}

#+INCLUDE: CheatSheet/CheatSheetSetup.org

* Administrivia :ignore:

#+latex: \vspace{1em}

OCaml is a strict language;
it is strongly typed where types are inferred.

I may write explicit type annotations below for demonstration
or clarity purposes.
  #+BEGIN_SRC ocaml
  (* Using explicit type annotations *)
  let x : int = 3;;
  let f (x : int) (y : string) (r : 'a) : float = 3.14;;
#+END_SRC

#+RESULTS:
: <fun>

Only when interacting with the top-level interpreter,
commands must be terminated by ~;;~.
OCaml uses ~;~ as an expression /separator/ ---not a terminator!

My Emacs setup for OCaml can be found on this [[https://github.com/alhassy/OCamlCheatSheet][CheatSheet's repo]].
* COMMENT more Administrivia

+ Command line interpreter, REPL, begun with ~ocaml~ and exited with ~exit 0;;~
  - All expressions in REPL must be terminated with ~;;~, not so in a script.
  - To load a source file enter ~#use "myfile.ml;;"~.

+ Only multi-line, nestable, comments: ~(* ... *)~.

+ All declarations are preceded by ~let~ or ~let rec~ for recursive ones.

+ Anonymous functions use the syntax: ~fun x₀ … xₙ -> ...~
  - ~function~ in-place of ~fun~ also works.
  - Infix functions can be used in prefix by enclosing them in parens; e.g., ~(+) 1 2.~

* Emacs Setup
First, let's get [Meta]OCaml.
#+BEGIN_SRC emacs-lisp
;; Easiest on my machine.
;; (async-shell-command "brew install ocaml")

;; The OCaml package manager: https://opam.ocaml.org/
(async-shell-command "brew install opam") ;; version 2.0.4

;; (async-shell-command "opam switch create 4.07.1")  ;; install ocaml
(async-shell-command "opam switch create 4.07.1+BER") ;; install metaocaml
#+END_SRC

Let's set this up for Emacs.
#+BEGIN_SRC emacs-lisp
(use-package tuareg :demand t)              ;; Emacs’ OCaml mode
(setq tuareg-support-metaocaml t)           ;; Only handles metaocaml syntax
(setq org-babel-ocaml-command "metaocaml")  ;; Different command for metaocaml
#+END_SRC

Let's obtain ~ocp-indent~ ---OCaml's indentation tool that indents the same even if
co-workers use a different editor--- and [[https://github.com/ocaml/merlin/wiki/emacs-from-scratch][merlin]] which provides interactive feedback
including context-aware completion and jumping to definitions.
#+BEGIN_SRC emacs-lisp
(async-shell-command "time opam install ocp-indent merlin") ;; real 1m33.636s
(use-package merlin)
(add-hook 'tuareg-mode-hook #'merlin-mode)
(with-eval-after-load 'merlin (setq merlin-command 'opam))
#+END_SRC
Now entering, say, ~List.~ brings a pop-up completion menu for the
contents of the list module.
#+latex: \texttt{List.}\null{}
#+latex: \hfill
---In org-src blocks, you need to enter the ocaml mode, via ~C-c '~.
# Or simple “M-x merline-mode” to use it /anywhere/, since it's a minor mode. :smile:
# The latter is not ideal since it can radically slow down literate writing.

:More:
+ C-c C-t :: Obtain type of OCaml identifier.

#+BEGIN_SRC ocaml
type nin = int;;
let x : nin = 1;;

x
#+END_SRC

#+RESULTS:
: 1

On ~x~, one ~C-c C-t~ yields ~nin~, further invocations improve verbosity by expanding
aliases to obtain ~int~.

+ Use ~merlin-type-expr~ to obtain the type of a given expression.
+ Use ~C-c C-l~ to jump to definition; ~merlin-locate~.

See here for more: https://github.com/ocaml/merlin/wiki/emacs-from-scratch
:End:

:Base_stuff_not_working:
#+BEGIN_SRC emacs-lisp :tangle no
;; Feature-rich full replacement to OCaml's standard library
(async-shell-command "time opam install base stdio")
;; This may appear to ‘hang’, but that's because it took me 13 minutes.
#+END_SRC

Ensuring libraries are loaded in toplevel ocaml sessions; the following is my
~~/.ocamlinit~.
#+BEGIN_SRC ocaml :tangle (when nil "~/.ocamlinit")
(* Added by OPAM. *)
  try Topdirs.dir_directory (Sys.getenv "OCAML_TOPLEVEL_PATH")
  with Not_found -> ();;

#use "topfind";;
#thread;;
#require "base";;
open Base;;
#+END_SRC
#require "core.top";;
#require "core.syntax";;

#+BEGIN_SRC ocaml
  let ratio1 x y = let open Float.O in of_int x / of_int y;;
#+END_SRC
:End:

* Arithmetic
  Operations on floats have a ‘.’ suffix.
  #+BEGIN_SRC ocaml
  8 / 3;;      (* 2 *)
  8 /. 3;;     (* Type error: /. is for floats *)
  8.0 /. 3.0;; (* 2.6666… *)
#+END_SRC

* Functions & Variables
A function is declared with the ~let~ keyword
---variables are functions of zero arguments.

\room
Function & varaible names /must/ begin with a lowercase letter, and may use _ or ~'~.
+ They cannot begin with capital letters or numbers, or contain dashes!
+ Functions are like variables, but with arguments, so the same syntax applies.

#
#+begin_parallel org
#+BEGIN_SRC ocaml
(* A curried function *)
let f x y = x + y

(* Function application *)
let result = f 10 (2 * 6)

(* Partial application *)
let g x = f x 2
#+END_SRC

#+latex: \columnbreak

#+BEGIN_SRC ocaml
(* We can re-bind variables *)
let x = 123
let x = string_of_int x
#+END_SRC

Recursive functions are marked with the ~rec~ keyword.
#+BEGIN_SRC ocaml
let rec fact n = if n = 0
		 then 1
		 else n * fact (n - 1)
#+END_SRC

#+end_parallel

 Here's an example of a higher-order function & multiple local functions
 & an infix operator & an anonymous function & the main method is
 parametricly polymorphic.
#+BEGIN_SRC ocaml
let try_add (bop : 'a -> 'a -> 'a) (test : 'a -> bool)
	    (default : 'a) (x : 'a) (y : 'a)
   = let (/@/) x y = bop x y
     (* Only select symbols can be used as infix operators *)
     (* (/@/) x y  =  x /@/ y *)
     and wrap a = if test a then a else default
     in wrap x /@/ wrap y;;

  699 = try_add (+) (fun a -> a mod 3 = 0) (666) (~-1) 33;;
  (* The anonymouse function uses ‘=’ as Boolean equality. *)

  ~- 2 = ~- 2 mod 3;; (* /Remainder/ after dividing out 3s *)
#+END_SRC

* Booleans
 Inequality is expressed with ~<>~.
#+BEGIN_SRC ocaml
(* false, true, false, true, false, true, true, 1 *)
true = false , true || false, true && false, true >= false
, 12 < 2, "abc" <= "abd", 1 <> 2
, if true then 1 else 2
#+END_SRC

* Strings

OCaml strings are not arrays, or lists, of characters as in C or Haskell.
#+BEGIN_SRC ocaml
"string catenation" = "string " ^ "catenation"

Printf.printf "%d %s" 1972 "taxi";;
let input = read_line ();;
#+END_SRC

:More:
+ Double quotes for strings, single quote for characters,
  and a single quote may be used as part of an identifier.
  - String catenation with ~(^).~
  - Not arrays, or lists, of characters as in C or Haskell.
  - Expected ~Print.printf string args~.
  - Also ~print_string~ and ~read_line ()~.
:End:

* Records
  Records: Products with named, rather than positional, components.
#+BEGIN_SRC ocaml
  type point2d = {x : float; y : float};;

  (* Construction *)
  let p = {y = 2.0; x = 3.4};;

  (* Pattern matching for deconstruction *)
  let {x = px; y = py} = p;;
  let go {x = qx; y = qy} = qx +. qy;;

  (* More tersely, using “field punning”: Variables must coincide with field names. *)
  let erroenous ({xx; y} : point2d )= x +. y;;
  let works {x; y} = 0.0;;

  (* Or we can use dot notation *)
  let go q = q.x +. q.y;;
#+END_SRC

