CheatSheet.org
* Variants and Pattern Matching
   Variant types: A unified way to combine different types into a single type;
   each case is distinuighed by a capitalised tag.

#+BEGIN_SRC ocaml
(* Constructors must start with a capital letter, like in Haskell *)
type 'a fancy_num =   Nothing | Boring of int | Fancy of 'a
		    | Point of point2d | Pair of 'a fancy_num * 'a fancy_num

let example = Pair (Fancy "twenty", Point {x = 1.2; y = 3.14})
#+END_SRC

The tags allow us to /extract/ components of a variant value
as well as to case against values by inspecting their tags.
This is /pattern matching/.

#+BEGIN_SRC ocaml
(* Destructuring a value *)
let Pair(head, _) = example;;

(* Guarded pattern matching, with in-line casing via ‘match’ *)
let rec sum acc = function
  | Nothing -> 0 + (match acc with true -> 1 | false -> 0)
  | Fancy x when x <= "nine" -> 0
  | (Fancy "twenty") as p -> failwith "Evil!"
  | Pair(l, r) -> sum acc l + sum acc r
  | _ -> 2 (* Default case *)

let res = sum true example (* Exception: Failure "Evil!" *)

(* Type aliases can also be formed this way *)
type myints = int
#+END_SRC

Note that we can give a pattern a name; above we mentioned ~p~,
but did not use it.

+ Repeated & non-exhaustive patterns trigger a warning; e.g., remove the default case above.

+ You can pattern match on arrays too; e.g.,
  ~[| x ; y ; z|] -> y~.

#+latex:  \room
The above mechanisms apply to all variants ---including tuples, lists, and options.

* COMMENT Type Construction
We can make an alias: ~type myInt = int~

However we can also make a new ADT and pattern match on it.

#+BEGIN_EXAMPLE
type 'a roseTree = Leaf of 'a | MkRoseTree of 'a roseTree list

let rec treeFilter p = function
  | MkRoseTree ts   -> MkRoseTree (List.map (treeFilter p) ts)
  | Leaf a when p a -> Leaf a
  | _               -> MkRoseTree []
#+END_EXAMPLE

  - As in Haskell, constructors must start with a capital letter
   *however* type names must begin with a lowercase letter.
  - We may omit the ~of ...~ to obtain nullary constructors, as expected.

  - Notice the optional guard ~when~ and the wildcard pattern ~_~.

Example usage:
#+BEGIN_EXAMPLE
let test = MkRoseTree [ Leaf 1 ; MkRoseTree [ Leaf 2; Leaf 3] ; MkRoseTree [Leaf 4] ]

let rec even = function
 | 0 -> true
 | 1 -> false
 | n -> even (n-2)

(*
# treeFilter even test;;
- : int roseTree =
MkRoseTree
 [MkRoseTree []; MkRoseTree [Leaf 2; MkRoseTree []]; MkRoseTree [Leaf 4]]
*)
#+END_EXAMPLE

* Tuples and Lists
  Tuples: Parentheses are optional, comma is the main operator.
#+BEGIN_SRC ocaml
  let mytuple  : int * string * float = (3, "three", 3.0);;

  (* Pattern matching & projection *)
  let (woah0, woah1, woah2) = mytuple;;
  let add_1and4 (w, x, y, z) = w + z;;
  let that = fst ("that", false)

  (* A singelton list of one tuple !!!!  *)
  let zs = [ 1, "two", true ]

  (* Lists:  type 'a list = [] | (::) of 'a * 'a list  *)
  let xs = [1; 2; 3]
  [1; 2; 3] = 1 :: 2 :: 3 :: [];; (* Syntactic sugar *)

  (* List catenation *)
  [1;2;4;6] = [1;2] @ [4;6];;

  (* Pattern matching example; Only works on lists of length 3 *)
  let go [x; y; z] = x + y + z;;
  14 = go [2;5;7];;

  (* Labelled arguments, using ‘~’, means position is irrelevant *)
  [1; 2; 3] = List.map ["a", "ab", "abc"] ~f:String.length;;
  [1; 2; 3] = List.map  ~f:String.length ["a", "ab", "abc"];;
#+END_SRC

:More:
Then,
| List.nth list index   |
| List.map func list    |
| List.filter func list |
| List.hd               |
| List.rev              |
| List.length           |
| String.length         |

+ Syntax: ~[x₀; ...; xₙ]~

  - Tuples are optionally enclosed in parens;
    hence ~[x₀, ..., xₙ]~ is a singleton list
    consisting of only one tuple!

+ Expected functionals:
    ~List.nth~ for list lookup,
    ~List.map~, ~List.filter~, etc.

+ Cons operation is denoted ~::~.

+ Arrays have syntax ~[|x₀; ...; xₙ|]~
   with 0-indexing lookup ~arr.(n)~.

:End:

* spacing newpage                                                    :ignore:
  \newpage

* Options
Option: Expressing whether a value is present or not.
#+BEGIN_SRC ocaml
  (* type 'a option = None | Some of 'a *)

  let divide x y : int option = if y = 0 then None else Some (x / y);;

  let getInt ox = match ox with None -> 0 | Some x -> x;;
  0 = getInt None;;
  2 = getInt (Some 2);;
#+END_SRC

* Imperative Programming ---Sequencing & ~main~

We may use begin/end or parentheses to group
expressions together.

#+begin_parallel org
#+BEGIN_SRC ocaml
(* Inline *)
let x = begin 1 * 2 end + (3 - 2);;

(* Parentheses *)
(  print_string "a"
 ; () (* This is the unit value *)
 ; 9
);;

(* Begin-end block *)
begin
  print_string "nice";
  "bye";
  true;
  10
end;;
#+END_SRC
#+end_parallel

Remember: Single semicolon ~;~ is for sequencing whereas double ~;;~ is for termination.

#+latex: \room
OCaml programs don't have a unique ~main~ function as in C, instead the entire file
is evaluated sequentially at startup, which may contain arbitrary expressions not just functional declarations,
and so in some sense the full codebase is one big ~main~ function.

* Imperative Programming ---Arrays
Zero-indexed Arrays: Indexing with ~.(i)~ and update with ~<-~.
#+BEGIN_SRC ocaml
let nums : int array = [| 1; 2; 3 |];;
nums.(0) <- 12;;

12 = nums.(0);;
[|12; 2; 3|] = nums;;
#+END_SRC

What is the /type/ of update, ~<-~? A function that returns the unit type!
---see ~myupdate~ below.

* Imperative Programming ---Unit Type

Operations whose use produces a side-effect return the ~unit~ type.
This’ akin to the role played by ~void~ in C.
A /function/ is a sequence of expressions; its /return value/
is the value of the final expression ---all other expressions
are of unit type.

#+begin_parallel org
#+BEGIN_SRC ocaml
(* type unit = () *)
let ex : unit = ();;

let myupdate (arr : 'a array) (e : 'a)
	     (i : int) : unit
  = arr.(i) <- e;;

myupdate nums 33 1;;
[|12; 33; 3|] = nums;;
#+END_SRC
#+latex: \columnbreak
#+BEGIN_SRC ocaml
let my_io () = print_endline "Hello!" ;;

let const x y
  = my_io();
    y;
    x;;

let res = const 1972 12;;
#+END_SRC
#+end_parallel

* Imperative programming ---Mutable records
Record fields are immutable by default, but can be declared mutable.
#+BEGIN_SRC ocaml
type running_sum = {mutable sum : int; mutable more : int};;

let create () = {sum = 0; more = 0};;

let update rs x =   rs.sum  <- rs.sum + rs.more
		  ; rs.more <- x;;

let  res = create ()
in   update res 12
   ; {sum = 0; more = 12} = res ;;
#+END_SRC

* Imperative Programming ---References
References: Single mutable values; i.e., a record with a single mutable field named ~contents~.
#+BEGIN_SRC ocaml
let x : int ref = {contents = 0}
in x.contents <- x.contents + 1; {contents = 1} = x;;
#+END_SRC

Refs come with a handful of convenience methods; here's their re-implementation:
#+BEGIN_SRC ocaml
(* Alias    *) type 'a ref  = {mutable contents : 'a};;
(* Creation *) let ref v    = {contents = v};;
(* Access   *) let (!) r    = r.contents;; (* “value of” *)
(* Update   *) let (:=) r e = r.contents <- e;;
#+END_SRC
Notice that ~ref~ is overloaded: As a type former and as a function forming values.
#+BEGIN_SRC ocaml
(* Summing the first 10 numbers *)
let  sum = ref 0
in   for i = 0 to 10 do sum := !sum + i done
   ; 55 = !sum;;
#+END_SRC

#+RESULTS:
: true

* COMMENT Imperative Programming ---Loops

At each iteration, cons the counter ~i~ to
the value of the list /so far/:
#+BEGIN_SRC ocaml
(* Using “i = 1 to 10” yields the reverse  *)
let xl = ref [] in
for i = 10 downto 1 do
xl := i :: !xl;
done;
!xl
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 |

#+BEGIN_SRC ocaml
let n = 100 and i = ref 0 and x = ref 0 in
while n <> !i do
  x := !x + !i; i := !i + 1;
done;
!x , 2 * !x = n * (n - 1)
#+END_SRC

#+RESULTS:
: (4950, true)

* spacing newpage                                                    :ignore:
  \newpage

