README.md


<a id="org93f0525"></a>

# Variants and Pattern Matching

Variant types: A unified way to combine different types into a single type;
each case is distinuighed by a capitalised tag.

    (* Constructors must start with a capital letter, like in Haskell *)
    type 'a fancy_num =   Nothing | Boring of int | Fancy of 'a
                | Point of point2d | Pair of 'a fancy_num * 'a fancy_num

    let example = Pair (Fancy "twenty", Point {x = 1.2; y = 3.14})

The tags allow us to *extract* components of a variant value
as well as to case against values by inspecting their tags.
This is *pattern matching*.

    (* Destructuring a value *)
    let Pair(head, _) = example;;

    (* Guarded pattern matching, with in-line casing via ‘match’ *)
    let rec sum acc = function
      | Nothing -> 0 + (match acc with true -> 1 | false -> 0)
      | Fancy x when x <= "nine" -> 0
      | (Fancy "twenty") as p -> failwith "Evil!"
      | Pair(l, r) -> sum acc l + sum acc r
      | _ -> 2 (* Default case *)

    let res = sum true example (* Exception: Failure "Evil!" *)

    (* Type aliases can also be formed this way *)
    type myints = int

Note that we can give a pattern a name; above we mentioned `p`,
but did not use it.

-   Repeated & non-exhaustive patterns trigger a warning; e.g., remove the default case above.

-   You can pattern match on arrays too; e.g.,
    `[| x ; y ; z|] -> y`.

The above mechanisms apply to all variants &#x2014;including tuples, lists, and options.


<a id="orgf54d5a5"></a>

# Tuples and Lists

Tuples: Parentheses are optional, comma is the main operator.

    let mytuple  : int * string * float = (3, "three", 3.0);;

    (* Pattern matching & projection *)
    let (woah0, woah1, woah2) = mytuple;;
    let add_1and4 (w, x, y, z) = w + z;;
    let that = fst ("that", false)

    (* A singelton list of one tuple !!!!  *)
    let zs = [ 1, "two", true ]

    (* Lists:  type 'a list = [] | (::) of 'a * 'a list  *)
    let xs = [1; 2; 3]
    [1; 2; 3] = 1 :: 2 :: 3 :: [];; (* Syntactic sugar *)

    (* List catenation *)
    [1;2;4;6] = [1;2] @ [4;6];;

    (* Pattern matching example; Only works on lists of length 3 *)
    let go [x; y; z] = x + y + z;;
    14 = go [2;5;7];;

    (* Labelled arguments, using ‘~’, means position is irrelevant *)
    [1; 2; 3] = List.map ["a", "ab", "abc"] ~f:String.length;;
    [1; 2; 3] = List.map  ~f:String.length ["a", "ab", "abc"];;

\columnbreak


<a id="orgeb77916"></a>

# Options

Option: Expressing whether a value is present or not.

    (* type 'a option = None | Some of 'a *)

    let divide x y : int option = if y = 0 then None else Some (x / y);;

    let getInt ox = match ox with None -> 0 | Some x -> x;;
    0 = getInt None;;
    2 = getInt (Some 2);;


<a id="orgf5f566d"></a>

# Imperative Programming &#x2014;Sequencing & `main`

We may use begin/end or parentheses to group
expressions together.

<div class="parallel">
    (* Inline *)
    let x = begin 1 * 2 end + (3 - 2);;

    (* Parentheses *)
    (  print_string "a"
     ; () (* This is the unit value *)
     ; 9
    );;

    (* Begin-end block *)
    begin
      print_string "nice";
      "bye";
      true;
      10
    end;;

</div>

Remember: Single semicolon `;` is for sequencing whereas double `;;` is for termination.

OCaml programs don't have a unique `main` function as in C, instead the entire file
is evaluated sequentially at startup, which may contain arbitrary expressions not just functional declarations,
and so in some sense the full codebase is one big `main` function.


<a id="org5137683"></a>

# Imperative Programming &#x2014;Arrays

Zero-indexed Arrays: Indexing with `.(i)` and update with `<-`.

    let nums : int array = [| 1; 2; 3 |];;
    nums.(0) <- 12;;

    12 = nums.(0);;
    [|12; 2; 3|] = nums;;

What is the *type* of update, `<-`? A function that returns the unit type!
&#x2014;see `myupdate` below.


<a id="org29b038e"></a>

# Imperative Programming &#x2014;Unit Type

Operations whose use produces a side-effect return the `unit` type.
This’ akin to the role played by `void` in C.
A *function* is a sequence of expressions; its *return value*
is the value of the final expression &#x2014;all other expressions
are of unit type.

<div class="parallel">
    (* type unit = () *)
    let ex : unit = ();;

    let myupdate (arr : 'a array) (e : 'a)
             (i : int) : unit
      = arr.(i) <- e;;

    myupdate nums 33 1;;
    [|12; 33; 3|] = nums;;

    let my_io () = print_endline "Hello!" ;;

    let const x y
      = my_io();
        y;
        x;;

    let res = const 1972 12;;

</div>


<a id="org3a1d938"></a>

# Imperative programming &#x2014;Mutable records

Record fields are immutable by default, but can be declared mutable.

    type running_sum = {mutable sum : int; mutable more : int};;

    let create () = {sum = 0; more = 0};;

    let update rs x =   rs.sum  <- rs.sum + rs.more
              ; rs.more <- x;;

    let  res = create ()
    in   update res 12
       ; {sum = 0; more = 12} = res ;;


<a id="org404e32c"></a>

# Imperative Programming &#x2014;References

References: Single mutable values; i.e., a record with a single mutable field named `contents`.

    let x : int ref = {contents = 0}
    in x.contents <- x.contents + 1; {contents = 1} = x;;

Refs come with a handful of convenience methods; here's their re-implementation:

    (* Alias    *) type 'a ref  = {mutable contents : 'a};;
    (* Creation *) let ref v    = {contents = v};;
    (* Access   *) let (!) r    = r.contents;; (* “value of” *)
    (* Update   *) let (:=) r e = r.contents <- e;;

Notice that `ref` is overloaded: As a type former and as a function forming values.

    (* Summing the first 10 numbers *)
    let  sum = ref 0
    in   for i = 0 to 10 do sum := !sum + i done
       ; 55 = !sum;;

    true

\columnbreak
