CheatSheet.org
* Modules

  OCaml files not only store & manage code, but also correspond to (second-class) ‘modules’,
  which act as boundaries that divide a program into conceptual units.

  + At its simplest, a module is a collection of definitions that are stored
    within a namespace.

  + Implementation details of a module can be hidden by using an
    /interface, module type, signature/ ---all are aliases.

    - ~val~ declarations specify values in a signature: ~val ⟪identifier⟫ : ⟪type⟫~.
    - A type is /abstract/ if its name is exposed in the interface but its definition is not: ~type t~.
      * It is conventional to use ~t~ for the name of such types.
    - Including the type definition in the interface makes the type /concrete/.

  + E.g., module names are derived, with capitalisation, automatically from file names.
    An interface for ~myfile.ml~ to constrain exposed interface is placed in ~myfile.mli~.

    This is nearly how C header and implementation files work.

  + Modules & signatures can be nested inside other modules.

Modules names always begin with a capital; their contents are accessed with
dot notation. Here is the general syntax:
#+BEGIN_SRC ocaml :tangle no
(* Module declaration *)
module ‘Name’ : ‘signature’ = struct ‘implementation’ end

(* Signature declaration *)
module type ‘Name’ = sig ‘sig_decls’ end

(* sig_decls are a space-separated sequence of “type” or “val : ‘name’ : ‘type’”
declarations. A “type” declaration with no “= ⋯” is an abstract type. *)
#+END_SRC

Without constructors ~type~ creates aliases, if we want to treat a type in two different
ways and have the compiler ensure we don't mess-up, we produce single-constructor new
types:
#
#+begin_parallel org
#+BEGIN_SRC ocaml
type person  = P of string;;
type address = A of string;;

let jasim : person  = P "jasim";;
let home  : address = A "the farm";;

(* Type error *)
let this : person = home;;

(* If needed, we could make coercions *)
let person_to_string : person -> string
 = function P s -> s

let address_of_string : string -> address
 = fun s -> A s
#+END_SRC
#+end_parallel

However, if the underlying type were the /same,/ this repetition could be error-prone.
Instead, we could use /generative modules/: Distinct types with the same underlying implementation.
Being ‘generative’ is akin to the ~new~ keyword in Java:
  Each use of the ~BasicImplementation~ module below makes a new type.

#
#+begin_parallel org
# (* We can have this on one line;
#   words “val, type” delimit constitutents. *)
#+BEGIN_SRC ocaml :session
module type EssentiallyString = sig
  type t
  val to_string : t -> string
  val from_string : string -> t
  val (=) : t -> t -> bool
  end

module BasicImplementaion
       : EssentiallyString = struct
  type t = string
  let to_string x = x
  let from_string x = x
  let (=) l r = String.(l = r)
end
#+END_SRC
#+end_parallel

Note that ~BasicImplemention~ is just a namespace where, e.g., ~t~ is an alias for ~string~.

#+BEGIN_SRC ocaml :session
(* Here we get to reuse the above, thereby avoiding repetition *)
module Person  : EssentiallyString = BasicImplementaion
module Address : EssentiallyString = BasicImplementaion

let jasim : Person.t  = Person.from_string "jasim";;
let home  : Address.t = Address.from_string "the farmlands";;

(* Type error: Expected a Person.t, but have a Address.t *)
let uhoh : Person.t = home;;
#+END_SRC

Note that we could have placed the definitions of ~EssentiallyString~
and \newline ~BasicImplementaion~ in-line for the ~Person~ and ~Address~ module
declarations ---without syntactic alterations--- but that would have
defeated our purpose of avoiding repetition.

#+latex: \room
Without the type annotation, we could accidentally forget to implement
part of the interface & OCaml would infer a different module type.
Use the ~module type of~ operator to see what was inferred.
# This operator computes a signature from a module.
#+BEGIN_SRC ocaml :session
module ErroneousImplementation = struct
  type t = string let (=) l r = String.(l = r)
end

module type S = (module type of ErroneousImplementation)
(* module type S = sig type t = string val ( = ) : 'a -> 'a -> bool end *)
#+END_SRC

#+latex: \hrule \room

Many /equivalent/ ways to use module contents ---the third is for small expressions.
+ Note the dot!
#+BEGIN_SRC ocaml :session
let qasim = Person.(from_string "jasim")
in   (let open Person in qasim = jasim)
   , Person.(=) qasim jasim
   , Person.(from_string "jasim" = jasim)
   (* Rebind module name to a shorter name *)
   , let module P = Person in P.(qasim = jasim)
;;
#+END_SRC

#+latex: \hrule \room

While opening a module [type] affects the environment used to search for identifiers,
/including/ a module is a way of adding new identifiers to a module [type] proper
---it is a copy-paste of constituents.
For example, we could re-organise ~EssentialyString~ into a hierarchy:
#+BEGIN_SRC ocaml
module type Type = sig type t end

module type Relation = sig include Type val (=) : t -> t -> bool end
(* module type Relation = sig type t val ( = ) : t -> t -> bool end *)

module type PingPong = sig
  include Type val from_string : string -> t val to_string : t -> string end
#+END_SRC

This allows us to form /extensions/ to modules, akin to C#:
To extend, say, the ~List~ module with a new function ~f~ so that
~List.f~ is valid, we make and open ~module List = struct let f = ⋯ include List~.
If we wanted to /override/ an existing ~f~, we put its definition after the include.

The interface would be ~sig val f : ⋯ include (module type of List) end~.

#+latex: \room \hrule \room

When we have multiple declarations of a type or we have type that is too abstract to be
of use, expect to see:
~Error: This expression has type 𝓉 but an expression was expected of type M.t~; instead maybe use ~M.t with type t = 𝓉~, where:
#+BEGIN_SRC ocaml :tangle no
(* “Constraint Sharing”: Declaration of t stays as an alias. *)
   sig type t val ⋯ end with type t = imp
≈  sig type t = imp val ⋯ end

(* “Destructive Substitution”: Declaration of t is gone. *)
   sig type t val ⋯t⋯ end with type t := imp
≈  sig val ⋯imp⋯ end
#+END_SRC
We may now continue our ~EssentiallyString~ hierarchy:
#+BEGIN_SRC ocaml
module type IntRelation = sig include Relation with type t := int end
(* Desugars: module type IntRelation = sig val ( = ) : int -> int -> bool end *)
module type EssentiallyStr = sig include Type include Relation with type t := t end
#+END_SRC

#+latex: \room \hrule \room

*Warning!*
The order of constructor declarations for a concrete type variant must be the
same in the implementation as in the interface, likewise for record fields and
function arguments.

* Functors

  Functors are, roughly speaking, functions from modules to modules.
  --- There's no “modules to module types” thing, [[https://stackoverflow.com/a/54783553/3550444][instead]] we return
  a module that contains a module type ;-) ---

  \room
  Functors provide the same abstraction features as functions do but also
  allow the implementation of one module to /vary/ depending on another module.
  In contrast to functions, functors require explicit type annotation
  ---otherwise how would we know what constituents the input module contains---
  and their arguments /must/ be enclosed in parentheses.

  In a sense, these are parameterised modules ---as in Agda--- and that is how
  they may be treated syntactically in OCaml:
  #+BEGIN_SRC ocaml
(* Example functor that takes a namespace having ‘x’
   and yields a namspace with ‘x’ incremented. *)

  module type OneInt = sig val x : int end;;
  module IncrementFunctor (M : OneInt) : OneInt = struct let x = M.x + 1 end;;

  module Three : OneInt = struct let x = 3 end;;
  module Four  : OneInt = IncrementFunctor(Three);;

  Four.x = Three.x + 1;;
#+END_SRC

  A functor may be applied to *any* module that satisfies the functor's input interface:
#+BEGIN_SRC ocaml
  module Point = struct let x = 0 let y = 1 end;;
  module One = IncrementFunctor(Point);;
  One.x = Point.x + 1;;
  #+END_SRC

