CheatSheet.org
* First-Class Modules

  Modules can contain types & values, but ordinary values can't contain modules or
  module types. In order to define variables whose value is a module, or a function
  that takes a module as an argument, OCaml provides /first-class modules/ which are
  ordinary values that can be created from and converted back to regular modules.

  # \room
  # Functors can thus be replaced by functions acting on first-class modules?/
  #

  A first-class module is created by packaging up a module with a signature that
  it satisfies by using the ~module~ keyword:
  #+BEGIN_SRC ocaml
 let three    : (module OneInt) = (module Three : OneInt);;
 let three'   = (module Three);; (* Error: Signature couldn't be inferred *)
 let three''  : (module OneInt) = (module Three);;
 let three''' = (module Three : OneInt);; (* Most terse ^_^ *)

 (* Lists are homogeneous, whence latters' type inferred from formers'  *)
 let list_of_modules = [three; (module Three); (module Four)];;
  #+END_SRC
# val list_of_modules : (module OneInt) list = [<module>; <module>; <module>]

  Dot notation only works for records and modules, so we access contents of a
  first-class module by turning it into an ordinary module with ~val~:
  #+BEGIN_SRC ocaml
  let x : int = let module M = (val three : OneInt) in M.x;;
  let x : int = (val three : OneInt).x;; (* Error: Invalid syntax. *)
  #+END_SRC

  *Warning!* The parentheses for these ~module, val~ keywords are important!

  Rule of thumb: Use the forms ~(module M : T)~ and ~(val M : T)~ always.

  We can create ordinary functions which consume and create first-class modules.
  #+BEGIN_SRC ocaml
  let unpack (m : (module OneInt)) : int = let module M = (val m) in M.x;;
  let pack (n : int) : (module OneInt) = (module struct let x = n end);;

  3 = unpack three;;
  3 = unpack (pack 3);;
  pack 3 = three;; (* Woah! Equality of modules! *)

  (* “Module pattern matching” *)
  (* unpack' : (module OneInt) -> int *)
  let unpack' (module M : OneInt) = M.x;;
  #+END_SRC

  #+RESULTS:
  : true

* spacing newpage                                                    :ignore:
  \newpage

* /Locally/ Abstract Types & ‘[un]bundling’

  Type variables are generally implicit, but we can treat them as abstract types
  in a function body yet still not pass them in explicitly at use-sites.
  #+BEGIN_SRC ocaml
  (* Where did the 'a come from? *)
  let wrap (x : 'a) : 'a list = [x];;

  (* Let's explicitly declare it! *)
  let wrap' (type a) (x : a) : a list = [x];;

  (* Usage doesn't change. *)
  wrap 1 = wrap' 1
  #+END_SRC

  One use is to connect the abstract types of a first-class module with other types
  we're working with ---by using constraint sharing.
  /That is, we ‘unbundle’ the type from ‘inside’ the module to its ‘type’./
  *This is a prime reason to use first-class modules!*

  #+latex: \room
  Here's an example where we approximate C#'s ~default~ keyword:
  #+BEGIN_SRC ocaml
  module type Pointed = sig type t val point : t end;;

  (* Error: The hidden type of M is exposed!
     “The type constructor M.t would escape its scope.”
     “here : (M:Pointed) → M.t” *)
  let default (module M : Pointed) = M.point;;

  (* default : (module Pointed with type t = 'a) -> 'a *)
  let default (type a) (module M : Pointed with type t = a) = M.point;;

  module Nat : Pointed with type t = int = struct type t = int let point = 0 end;;
  (* module Nat = struct type t = int let point = 0 end;; *)

  (* ‘default’ works on first-class modules *)
  0 = default(module Nat)
  #+END_SRC

  /Conversely, this allows us to ‘bundle’ up data to form a module!/
  #+BEGIN_SRC ocaml
  (* make_pointed : 'a -> (module Pointed with type t = 'a) *)
  let make_pointed (type a) (x : a) : (module Pointed with type t = a)
    = (module struct type t = a let point = x end)
  #+END_SRC

* spacing vfill :ignore:
  #+latex: \vfill

* Metaprogramming with [[http://okmij.org/ftp/ML/MetaOCaml.html][MetaOCaml]]

  Quasi-quote expressions with ‘brackets’ ~.< expr >.~
  /to delay their execution/
  and splice quoted items into such an expression with ‘escape’ ~.~expr.~
  Finally, code can be ‘run’ with ~Runcode.run expr~.

  #+latex: \room
  *Warning!* You must use the ~metaocaml~ command rather than the ~ocaml~ command.

  #+BEGIN_SRC ocaml
  open Runcode;;

  (* Addition is not performed right now, but transformed into ‘code’ *)
  let x : int code = .<1 + 2>.;; (* .<1 + 2>. *)

  (* Actually execute the addition *)
  let y : int = run x;;

  (* Example using escape *)
  let z : int code = .< let res = .~x in res + res >.;;
  6 = run z;;

  (* A more complicated example *)

  (* Desugars using a fresh name: .<fun x_4 -> 2 * x_4>. *)
  let ff = let c = 2 in .< fun x -> c * x >.;;
  let six = .< .~ff 3 >.;; (* .<(fun x_14 -> 2 * x_14) 3>. *)
  #+END_SRC

  The traditional ‘staging of the power function’ example
  can be found [[http://ocamllabs.io/iocamljs/staging.html][here]] ---as a Jupyter Notebook.

  #+latex: \room
  For more, see [[http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.438.6924&rep=rep1&type=pdf][A Gentle Introduction to Multi-stage Programming]]
  + The deprecated ~!.~ is replaced with ~Runcode.run~.
  + A Haskell rendition can be found [[https://github.com/alhassy/multistage-programming-taha][here]].

* spacing newpage                                                    :ignore:
  \newpage
* Reads

+ [X] [[https://learnxinyminutes.com/docs/ocaml/][Learn /x/ in /y/ minutes, where /x = OCaml/ ]]
+ [X] [[https://try.ocamlpro.com/][Try OCaml, online]]
+ [X] [[https://realworldocaml.org/][Real World OCaml]]
+ [ ] [[https://ocaml.org/learn/tutorials][OCaml meta tutorial]] ---including [[https://ocaml.org/learn/tutorials/99problems.html][99 Problems]]
+ [ ] [[http://ocaml.github.io/ocamlunix/?ref=hackr.io][Unix system programming in OCaml]]

* COMMENT Making README.md

C-c C-c: Evaluate src block.

#+NAME: make-readme
#+BEGIN_SRC elisp :results none
(with-temp-buffer
    (insert
    "#+EXPORT_FILE_NAME: README.md
     #+HTML: <h1> OCamlCheatSheet </h1>
     #+OPTIONS: toc:nil d:nil
     # Toc is displayed below at a strategic position.

     Quick reference for the OCaml language.

     *The listing sheet, as PDF, can be found
     [here]({{{URL}}}/blob/master/CheatSheet.pdf)*,
     while below is an unruly html rendition.

     This reference sheet is built around the system
     https://github.com/alhassy/CheatSheet.

     #+TOC: headlines 2
     #+INCLUDE: CheatSheet.org
    ")
    (org-mode)
    (org-md-export-to-markdown)
)
#+END_SRC

* COMMENT footer

# Local Variables:
# eval: (org-babel-tangle)
# eval: (progn (org-babel-goto-named-src-block "make-readme") (org-babel-execute-src-block) (outline-hide-sublevels 1))
# compile-command: (org-latex-export-to-pdf)
# End:
