README.md


<a id="orgd473c93"></a>

# First-Class Modules

Modules can contain types & values, but ordinary values can't contain modules or
module types. In order to define variables whose value is a module, or a function
that takes a module as an argument, OCaml provides *first-class modules* which are
ordinary values that can be created from and converted back to regular modules.

A first-class module is created by packaging up a module with a signature that
it satisfies by using the `module` keyword:

    let three    : (module OneInt) = (module Three : OneInt);;
    let three'   = (module Three);; (* Error: Signature couldn't be inferred *)
    let three''  : (module OneInt) = (module Three);;
    let three''' = (module Three : OneInt);; (* Most terse ^_^ *)

    (* Lists are homogeneous, whence latters' type inferred from formers'  *)
    let list_of_modules = [three; (module Three); (module Four)];;

Dot notation only works for records and modules, so we access contents of a
first-class module by turning it into an ordinary module with `val`:

    let x : int = let module M = (val three : OneInt) in M.x;;
    let x : int = (val three : OneInt).x;; (* Error: Invalid syntax. *)

**Warning!** The parentheses for these `module, val` keywords are important!

Rule of thumb: Use the forms `(module M : T)` and `(val M : T)` always.

We can create ordinary functions which consume and create first-class modules.

    let unpack (m : (module OneInt)) : int = let module M = (val m) in M.x;;
    let pack (n : int) : (module OneInt) = (module struct let x = n end);;

    3 = unpack three;;
    3 = unpack (pack 3);;
    pack 3 = three;; (* Woah! Equality of modules! *)

    (* “Module pattern matching” *)
    (* unpack' : (module OneInt) -> int *)
    let unpack' (module M : OneInt) = M.x;;

    true

\columnbreak


<a id="orgdefc8fd"></a>

# *Locally* Abstract Types & ‘[un]bundling’

Type variables are generally implicit, but we can treat them as abstract types
in a function body yet still not pass them in explicitly at use-sites.

    (* Where did the 'a come from? *)
    let wrap (x : 'a) : 'a list = [x];;

    (* Let's explicitly declare it! *)
    let wrap' (type a) (x : a) : a list = [x];;

    (* Usage doesn't change. *)
    wrap 1 = wrap' 1

One use is to connect the abstract types of a first-class module with other types
we're working with &#x2014;by using constraint sharing.
*That is, we ‘unbundle’ the type from ‘inside’ the module to its ‘type’.*
**This is a prime reason to use first-class modules!**

Here's an example where we approximate C#'s `default` keyword:

    module type Pointed = sig type t val point : t end;;

    (* Error: The hidden type of M is exposed!
       “The type constructor M.t would escape its scope.”
       “here : (M:Pointed) → M.t” *)
    let default (module M : Pointed) = M.point;;

    (* default : (module Pointed with type t = 'a) -> 'a *)
    let default (type a) (module M : Pointed with type t = a) = M.point;;

    module Nat : Pointed with type t = int = struct type t = int let point = 0 end;;
    (* module Nat = struct type t = int let point = 0 end;; *)

    (* ‘default’ works on first-class modules *)
    0 = default(module Nat)

*Conversely, this allows us to ‘bundle’ up data to form a module!*

    (* make_pointed : 'a -> (module Pointed with type t = 'a) *)
    let make_pointed (type a) (x : a) : (module Pointed with type t = a)
      = (module struct type t = a let point = x end)



<a id="org2e5e6c5"></a>

# Metaprogramming with [MetaOCaml](http://okmij.org/ftp/ML/MetaOCaml.html)

Quasi-quote expressions with ‘brackets’ `.< expr >.`
*to delay their execution*
and splice quoted items into such an expression with ‘escape’ `.~expr.`
Finally, code can be ‘run’ with `Runcode.run expr`.

**Warning!** You must use the `metaocaml` command rather than the `ocaml` command.

    open Runcode;;

    (* Addition is not performed right now, but transformed into ‘code’ *)
    let x : int code = .<1 + 2>.;; (* .<1 + 2>. *)

    (* Actually execute the addition *)
    let y : int = run x;;

    (* Example using escape *)
    let z : int code = .< let res = .~x in res + res >.;;
    6 = run z;;

    (* A more complicated example *)

    (* Desugars using a fresh name: .<fun x_4 -> 2 * x_4>. *)
    let ff = let c = 2 in .< fun x -> c * x >.;;
    let six = .< .~ff 3 >.;; (* .<(fun x_14 -> 2 * x_14) 3>. *)

The traditional ‘staging of the power function’ example
can be found [here](http://ocamllabs.io/iocamljs/staging.html) &#x2014;as a Jupyter Notebook.

For more, see [A Gentle Introduction to Multi-stage Programming](http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.438.6924&rep=rep1&type=pdf)

-   The deprecated `!.` is replaced with `Runcode.run`.
-   A Haskell rendition can be found [here](https://github.com/alhassy/multistage-programming-taha).

\columnbreak


<a id="org3b42df5"></a>

# Reads

-   [X] [Learn *x* in *y* minutes, where *x = OCaml* ](https://learnxinyminutes.com/docs/ocaml/)
-   [X] [Try OCaml, online](https://try.ocamlpro.com/)
-   [X] [Real World OCaml](https://realworldocaml.org/)
-   [ ] [OCaml meta tutorial](https://ocaml.org/learn/tutorials) &#x2014;including [99 Problems](https://ocaml.org/learn/tutorials/99problems.html)
-   [ ] [Unix system programming in OCaml](http://ocaml.github.io/ocamlunix/?ref=hackr.io)
